import training_courses_1 from "../assets/training_courses_1.webp";
import tests_question_1 from "../assets/tests_question_1.jpeg";
import training_courses_2 from "../assets/training_courses_2.webp";
import lesson_guest_service from "../assets/lesson_guest_service.webp";
import lesson_handwash from "../assets/lesson_handwash.webp";
import lesson_order from "../assets/lesson_order.webp";



export const new_mock_training_courses = [
    {
        id: "course_001",
        image: training_courses_2,
        title: "Искусство обслуживания в ресторане",
        description:
            "Этот курс научит вас основам профессионального обслуживания гостей в ресторане. Вы узнаете, как правильно приветствовать посетителей и создавать приятную атмосферу. Освоите техники общения с клиентами и правила сервировки стола. Курс поможет справляться с жалобами и сложными ситуациями. Он идеально подходит для новых сотрудников и тех, кто хочет улучшить свои навыки. После прохождения вы станете уверенным и компетентным официантом.",
        completedLessons: 1,
        completedTests: 1,
        lessons: [
            {
                id: "lesson_001",
                type: "lesson",
                title: "Введение в обслуживание гостей",
                image: lesson_guest_service,
                blocks: [
                    {
                        id: "block_001",
                        blockTitle: "Первое впечатление",
                        blockText:
                            "Первое впечатление о ресторане складывается в первые мгновения, когда гость переступает порог заведения. Эти 30 секунд общения с официантом могут определить, захочет ли посетитель вернуться снова. Улыбка — это первое, что замечают гости, и она должна быть искренней, чтобы создать ощущение уюта. Вежливость в словах и жестах подчёркивает профессионализм и уважение к клиенту. Аккуратный внешний вид официанта, включая чистую униформу и убранные волосы, говорит о высоком уровне сервиса. Важно также учитывать тон голоса — он должен быть спокойным и уверенным, чтобы не вызывать у гостя дискомфорта. Например, простое приветствие вроде «Добрый вечер, рады вас видеть!» может сразу расположить человека. Ключ к успеху — это сочетание всех этих мелочей, которые вместе создают незабываемый опыт. Со временем вы научитесь интуитивно чувствовать настроение гостя и подстраиваться под него. В этом блоке мы разберём, как сделать первые секунды идеальными.",
                        media: [
                            "https://example.com/images/smiling-waiter.png",
                            "https://example.com/videos/greeting.mp4",
                        ],
                    },
                    {
                        id: "block_002",
                        blockTitle: "Правила этикета",
                        blockText:
                            "Этикет в ресторанном деле — это не просто формальность, а искусство, которое делает обслуживание изысканным. Подача блюд и напитков требует чёткого соблюдения правил, чтобы гость чувствовал себя особенным. Например, блюда всегда подаются с правой стороны, а убираются с левой — это традиция, уходящая корнями в историю европейского сервиса. Напитки наливаются аккуратно, без лишнего шума, чтобы не отвлекать гостей от их разговоров. Важно также следить за осанкой: сутулый официант выглядит непрофессионально и портит общее впечатление. Каждый жест должен быть продуманным — от того, как вы держите поднос, до того, как кладёте салфетку на стол. В этом блоке вы узнаете, как соблюдать баланс между скоростью и грацией, чтобы сервис был ненавязчивым, но эффективным. Мы разберём типичные ошибки, такие как неправильное расположение приборов, и научимся их избегать. Со временем эти правила станут вашей второй натурой. Главное — сохранять высокий уровень сервиса даже в самые忙碌ые смены.",
                        media: ["https://example.com/images/table-setting.jpg"],
                    },
                ],
            },
            {
                id: "lesson_002",
                type: "lesson",
                title: "Работа с заказами",
                image: lesson_order,
                blocks: [
                    {
                        id: "block_003",
                        blockTitle: "Прием заказа",
                        blockText:
                            "Приём заказа — это один из самых ответственных этапов работы официанта, ведь от него зависит満足度 гостя. Важно не только быстро записать пожелания, но и внимательно выслушать клиента, чтобы избежать ошибок. Представьте ситуацию: гость просит убрать орехи из блюда из-за аллергии, а вы этого не заметили — это может привести к серьёзным последствиям. Поэтому всегда уточняйте детали, даже если кажется, что всё понятно с первого раза. Используйте блокнот или терминал, чтобы фиксировать заказы точно, особенно в часы пик, когда легко что-то упустить. Улыбка и доброжелательный тон помогут снять напряжение, если гость нервничает или торопится. В этом блоке мы разберём, как работать с разными типами клиентов — от тех, кто знает, чего хочет, до тех, кто нуждается в рекомендациях. Вы научитесь задавать правильные вопросы, например: «Желаете ли вы что-то к основному блюду?» Это не только улучшит сервис, но и увеличит чек. Со временем вы сможете принимать заказы быстро и безошибочно даже в самой шумной обстановке.",
                        media: ["https://example.com/images/order-taking.png"],
                    },
                ],
            },
        ],
        tests: [
            {
                id: "test_001",
                title: "Проверка знаний по приветствию",
                description:
                    "Тест проверит, как хорошо вы усвоили правила встречи гостей.",
                questions: [
                    {
                        id: "question_001",
                        question: "Что нужно сделать при встрече гостя?",
                        timeLimit: 60,
                        correctAnswersCount: 1,
                        type: "single",
                        hint: "Это первое действие официанта",
                        image: tests_question_1,
                        options: [
                            "Улыбнуться",
                            "Проверить заказ",
                            "Уйти",
                            "Подать меню",
                        ],
                        correctAnswer: "Улыбнуться",
                    },
                    {
                        id: "question_002",
                        question: "Какие элементы важны для этикета?",
                        timeLimit: 90,
                        correctAnswersCount: 2,
                        type: "multiple",
                        image: tests_question_1,
                        hint: "Подумайте о внешнем виде и поведении",
                        options: [
                            "Униформа",
                            "Громкий голос",
                            "Вежливость",
                            "Скорость",
                        ],
                        correctAnswers: ["Униформа", "Вежливость"],
                    },
                ],
            },
            {
                id: "test_002",
                title: "Тест по работе с заказами",
                description:
                    "Проверьте свои навыки в приеме и обработке заказов.",
                questions: [
                    {
                        id: "question_001",
                        question:
                            "Что делать, если гость хочет изменить заказ?",
                        timeLimit: 120,
                        correctAnswersCount: 1,
                        type: "open",
                        image: tests_question_1,
                        hint: "Это связано с гибкостью",
                        correctAnswer:
                            "Вежливо уточнить новый заказ и передать на кухню",
                    },
                    {
                        id: "question_002",
                        question:
                            "Как поступить, если гость просит рекомендацию по выбору блюда?",
                        timeLimit: 90,
                        correctAnswersCount: 1,
                        type: "open",
                        image: tests_question_1,
                        hint: "Учитывайте предпочтения гостя",
                        correctAnswer:
                            "Уточнить предпочтения и ограничения, затем предложить несколько вариантов с описанием",
                    },
                    {
                        id: "question_003",
                        question:
                            "Что делать, если гость жалуется на долгое ожидание заказа?",
                        timeLimit: 150,
                        correctAnswersCount: 1,
                        type: "open",
                        image: tests_question_1,
                        hint: "Важно проявить понимание",
                        correctAnswer:
                            "Извиниться, уточнить статус заказа на кухне и предложить комплимент от заведения в качестве извинений",
                    },
                ],
            },
        ],
    },
    {
        id: "course_002",
        image: training_courses_1,
        title: "Безопасность на кухне",
        description:
            "Курс посвящен основам безопасности при работе на кухне ресторана. Вы узнаете, как правильно обращаться с оборудованием и избегать травм. Освоите правила хранения продуктов и поддержания чистоты. Уроки помогут вам понять, как реагировать на чрезвычайные ситуации. Этот курс обязателен для всех сотрудников кухни. После обучения вы сможете работать безопасно и эффективно.",
        completedLessons: 0,
        completedTests: 0,
        lessons: [
            {
                id: "lesson_003",
                type: "lesson",
                title: "Основы гигиены",
                image: lesson_handwash,
                blocks: [
                    {
                        id: "block_004",
                        blockTitle: "Мытье рук",
                        blockText:
                            "Мытьё рук — это не просто рутина, а важнейшая часть работы на кухне, которая защищает и сотрудников, и гостей. Бактерии могут легко распространяться через грязные руки, особенно если вы работаете с сырыми продуктами, такими как мясо или рыба. Процесс кажется простым, но требует внимания: используйте тёплую воду, мыло и мойте руки не менее 40 секунд, уделяя внимание ногтям и между пальцами. Это особенно важно перед началом смены, после перерыва или после контакта с потенциально опасными поверхностями. Забудьте о спешке — недостаточно просто ополоснуть руки, иначе вы рискуете нарушить санитарные нормы. В этом блоке мы разберём, как правильно организовать процесс, чтобы он стал привычкой. Вы узнаете, как избежать типичных ошибок, таких как использование холодной воды или пропуск мытья после касания мусорного ведра. Чистые руки — это ваша первая линия защиты в создании безопасной кухни. Со временем вы заметите, что это не только требование, но и залог уверенности в своей работе.",
                        media: ["https://example.com/videos/hand-washing.mp4"],
                    },
                    {
                        id: "block_005",
                        blockTitle: "Уборка рабочего места",
                        blockText:
                            "Поддержание чистоты на рабочем месте — это не просто эстетика, а основа безопасной и продуктивной кухни. Грязные поверхности могут стать источником бактерий, которые испортят продукты и приведут к жалобам гостей. Уборка начинается с мелочей: протрите стол после каждой операции, уберите пролитые жидкости и не оставляйте ножи без присмотра. Важно также регулярно дезинфицировать оборудование, особенно если вы работаете с разными типами продуктов, чтобы избежать перекрёстного загрязнения. В этом блоке мы разберём, как организовать уборку так, чтобы она не мешала рабочему процессу. Вы узнаете, какие средства лучше использовать и как часто нужно проводить глубокую чистку. Представьте: чистая кухня не только соответствует нормам, но и повышает вашу эффективность, ведь всё нужное всегда под рукой. Это дисциплина, которая со временем превращается в привычку и делает вашу работу комфортнее. Мы также рассмотрим примеры, как грязь может привести к авариям, чтобы вы поняли важность этого шага.",
                        media: ["https://example.com/images/clean-kitchen.jpg"],
                    },
                ],
            },
        ],
        tests: [
            {
                id: "test_003",
                title: "Тест по гигиене",
                description: "Проверка знаний о санитарных нормах на кухне.",
                questions: [
                    {
                        id: "question_004",
                        question: "Как часто нужно мыть руки?",
                        timeLimit: 60,
                        correctAnswersCount: 1,
                        type: "single",
                        image: tests_question_1,
                        hint: "Это зависит от контакта с продуктами",
                        options: [
                            "Каждый час",
                            "Перед работой с едой",
                            "Раз в смену",
                            "Никогда",
                        ],
                        correctAnswer: "Перед работой с едой",
                    },
                ],
            },
        ],
    },
];
